/*
* Создать классы Собака, Лошадь, Птица и Кот с наследованием от класса Животное.

 * Животные могут выполнять действия: бежать, плыть, перепрыгивать препятствие.
*  В качестве параметра каждому методу передается величина, означающая или
* длину препятствия (для бега и плавания), или высоту (для прыжков).

У каждого животного есть ограничения на действия
* (бег: кот 200 м., собака 500 м., Лошадь 1500 м., Птица 5 м.,;
* прыжок: кот 2 м., собака 0.5 м., Лошадь 3 м., Птица 0.2 м. ;
*  плавание: кот и птица не умеет плавать, собака 10 м., лошадь 100 м.).

При попытке животного выполнить одно из этих действий, оно должно сообщить результат.
*  (Например, dog1.run(150); -> результат: 'Пёсик пробежал!')

* Добавить животным разброс в ограничениях. То есть у одной собаки
* ограничение на бег может быть 400 м., у другой 600 м.DD*/

public class HomeWork5 {
    public static void main(String[] args) {

    Animals zoo[]={new Dog("Rex"), new Dog("Myxtar"),
            new Cat("Tomas"),new Cat("Leopold"),
            new Horse("Vavilon"),new Horse("poni Agat"),
            new Bird("Raven"),new Bird("Parrot")};

    for (int i=0; i<zoo.length;i++){
         zoo[i].run(450);
        zoo[i].swim(20);
        zoo[i].jump(2);
     }
    zoo[0].setRangeRun(400);//таким образом можно изменить выносливость для животных
    zoo[1].setRangeRun(600);
    zoo[2].setRangeSwim(2000);//котику тоже можно изменить выносливость в плавании, но от этого плавать он не начнет)

        for (int i=0; i<2;i++){
            zoo[i].run(450);
            zoo[i].swim(20);
            zoo[i].jump(2);
        }
}
    }
